# DateTime

In [43]:
import pandas as pd
from pandas import DataFrame

In [44]:
df=pd.read_csv('Alcohol_Sales.csv')

In [45]:
df.head()

         DATE  S4248SM144NCEN
0  1992-01-01            3459
1  1992-02-01            3458
2  1992-03-01            4002
3  1992-04-01            4564
4  1992-05-01            4221

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 325 entries, 0 to 324
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   DATE            325 non-null    object
 1   S4248SM144NCEN  325 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.2+ KB

In [47]:
# rename columns
df.rename(columns={'DATE': 'date','S4248SM144NCEN': 'sale'}, inplace=True)

In [48]:
df

           date   sale
0    1992-01-01   3459
1    1992-02-01   3458
2    1992-03-01   4002
3    1992-04-01   4564
4    1992-05-01   4221
..          ...    ...
320  2018-09-01  12396
321  2018-10-01  13914
322  2018-11-01  14174
323  2018-12-01  15504
324  2019-01-01  10718

[325 rows x 2 columns]

In [52]:
df['date']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
320   2018-09-01
321   2018-10-01
322   2018-11-01
323   2018-12-01
324   2019-01-01
Name: date, Length: 325, dtype: datetime64[ns]

In [53]:
def date_break(df, date):
    
    df[date] = pd.to_datetime(df[date])
    df['year'] = df[date].dt.year
    df['quarter'] = df[date].dt.quarter
    df['month'] = df[date].dt.month
    df['day_of_week'] = df[date].dt.dayofweek  # Monday=0, Sunday=6
    df['day'] = df[date].dt.day
    
    return df

In [54]:
data = {'date': df['date']}
df = pd.DataFrame(data)
df = date_break(df, date='date')
print(df)

          date  year  quarter  month  day_of_week  day
0   1992-01-01  1992        1      1            2    1
1   1992-02-01  1992        1      2            5    1
2   1992-03-01  1992        1      3            6    1
3   1992-04-01  1992        2      4            2    1
4   1992-05-01  1992        2      5            4    1
..         ...   ...      ...    ...          ...  ...
320 2018-09-01  2018        3      9            5    1
321 2018-10-01  2018        4     10            0    1
322 2018-11-01  2018        4     11            3    1
323 2018-12-01  2018        4     12            5    1
324 2019-01-01  2019        1      1            1    1

[325 rows x 6 columns]